//Второе задание
// alert("Привет, мир!");

//Третье задание
// let admin;
// let name;
// name = "Джон";
// admin = name;
// alert(admin);

//Четвертое задание
// let OurPlanetName = "земля";
// let currentUserName = "Джон";

//Пятое задание
// const birthday = '18.04.1982';//тут можно использовать заглавные буквы
// const age = someCode(birthday);//тут нельзя использовать заглавные буквы

//Шестое задание
// let name = "Ilya";
// alert( `hello ${1}` ); // выведет hello 1
// alert( `hello ${"name"}` ); // выведет hello name
// alert( `hello ${name}` ); // выведет hello Ilya

//Седьмое задание
// let userName = prompt("Как вас зовут?");
// alert (userName);

//Восьмое задание
// let a = 1, b = 1;
// let c = ++a; // ответ: 2
// let d = b++; // ответ: 2

//Девятое задание
// let a = 2; // ответ: 4
// let x = 1 + (a *= 2); // ответ: 5

//Десятое задание
// "" + 1 + 0 // ответ: "10"
// "" - 1 + 0 // ответ:  "1"
// true + false // ответ: непонятно
// 6 / "3" // ответ: 2
// "2" * "3" // ответ: 6 
// 4 + 5 + "px" // ответ: 9px 
// "$" + 4 + 5 // ответ: $45
// "4" - 2 // ответ: 2
// "4px" - 2 // ответ:  NaN
// 7 / 0 // ответ: Infinity
// "  -9  " + 5 // ответ: непонятно
// "  -9  " - 5 // ответ: непонятно
// null + 1 // ответ: 1
// undefined + 1 // ответ: NaN 
// " \t \n" - 2 // ответ: -2

//Одиннадцатое задание
// let a = prompt("Первое число?", 1);
// let b = prompt("Второе число?", 2);
// alert(+a + +b);


//Двенадцатое задание